modm-ext/data.modm.io/docs/svd/header_stm32h745xg_cm7.svd
        <register>
          <name>ADC4R</name>
          <description>HRTIM ADC Trigger 4 register</description>
          <addressOffset>0x3c8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AD4MC1</name>
              <description>ADC Trigger 4 on master compare 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4MC2</name>
              <description>ADC Trigger 4 on master compare 2</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4MC3</name>
              <description>ADC Trigger 4 on master compare 3</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4MC4</name>
              <description>ADC Trigger 4 on master compare 4</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4MPER</name>
              <description>ADC Trigger 4 on master period</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4EEV6</name>
              <description>ADC Trigger 4 on external event 6</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4EEV7</name>
              <description>ADC Trigger 4 on external event 7</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4EEV8</name>
              <description>ADC Trigger 4 on external event 8</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4EEV9</name>
              <description>ADC Trigger 4 on external event 9</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4EEV10</name>
              <description>ADC Trigger 4 on external event 10</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4TAC2</name>
              <description>ADC Trigger 4 on Timer A compare 2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4TAC3</name>
              <description>ADC Trigger 4 on Timer A compare 3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4TAC4</name>
              <description>ADC Trigger 4 on Timer A compare 4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4TAPER</name>
              <description>ADC Trigger 4 on Timer A period</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4TBC2</name>
              <description>ADC Trigger 4 on Timer B compare 2</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4TBC3</name>
              <description>ADC Trigger 4 on Timer B compare 3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4TBC4</name>
              <description>ADC Trigger 4 on Timer B compare 4</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4TBPER</name>
              <description>ADC Trigger 4 on Timer B period</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4TCC2</name>
              <description>ADC Trigger 4 on Timer C compare 2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4TCC3</name>
              <description>ADC Trigger 4 on Timer C compare 3</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4TCC4</name>
              <description>ADC Trigger 4 on Timer C compare 4</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4TCPER</name>
              <description>ADC Trigger 4 on Timer C period</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4TCRST</name>
              <description>ADC Trigger 4 on Timer C reset</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4TDC2</name>
              <description>ADC Trigger 4 on Timer D compare 2</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4TDC3</name>
              <description>ADC Trigger 4 on Timer D compare 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4TDC4</name>
              <description>ADC Trigger 4 on Timer D compare 4</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4TDPER</name>
              <description>ADC Trigger 4 on Timer D period</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4TDRST</name>
              <description>ADC Trigger 4 on Timer D reset</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4TEC2</name>
              <description>ADC Trigger 4 on Timer E compare 2</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4TEC3</name>
              <description>ADC Trigger 4 on Timer E compare 3</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4TEC4</name>
              <description>ADC Trigger 4 on Timer E compare 4</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD4TERST</name>
              <description>ADC Trigger 4 on Timer E reset</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FLTINR1</name>
          <description>HRTIM Fault input register1</description>
          <addressOffset>0x3d0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FLT1E</name>
              <description>Fault 1 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT1P</name>
              <description>Fault 1 polarity</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT1SRC</name>
              <description>Fault 1 source</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT1F</name>
              <description>Fault 1 filter</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FLT1LCK</name>
              <description>Fault 1 lock</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT2E</name>
              <description>Fault 2 enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT2P</name>
              <description>Fault 2 polarity</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT2SRC</name>
              <description>Fault 2 source</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT2F</name>
              <description>Fault 2 filter</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FLT2LCK</name>
              <description>Fault 2 lock</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT3E</name>
              <description>Fault 3 enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT3P</name>
              <description>Fault 3 polarity</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT3SRC</name>
              <description>Fault 3 source</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT3F</name>
              <description>Fault 3 filter</description>
              <bitOffset>19</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FLT3LCK</name>
              <description>Fault 3 lock</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT4E</name>
              <description>Fault 4 enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT4P</name>
              <description>Fault 4 polarity</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT4SRC</name>
              <description>Fault 4 source</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT4F</name>
              <description>Fault 4 filter</description>
              <bitOffset>27</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FLT4LCK</name>
              <description>Fault 4 lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FLTINR2</name>
          <description>HRTIM Fault input register2</description>
          <addressOffset>0x3d4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FLT5E</name>
              <description>Fault 5 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT5P</name>
              <description>Fault 5 polarity</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT5SRC</name>
              <description>Fault 5 source</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT5F</name>
              <description>Fault 5 filter</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FLT5LCK</name>
              <description>Fault 5 lock</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLTSD</name>
              <description>Fault sampling clock division</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BDMUPR</name>
          <description>HRTIM Burst DMA Master Timer update register</description>
          <addressOffset>0x3d8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MCR</name>
              <description>MCR register update enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MICR</name>
              <description>MICR register update enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MDIER</name>
              <description>MDIER register update enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCNT</name>
              <description>MCNT register update enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MPER</name>
              <description>MPER register update enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MREP</name>
              <description>MREP register update enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCMP1</name>
              <description>MCMP1 register update enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCMP2</name>
              <description>MCMP2 register update enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCMP3</name>
              <description>MCMP3 register update enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCMP4</name>
              <description>MPCMP4 register update enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BDTAUPR</name>
          <description>HRTIM Burst DMA Timerx update register</description>
          <addressOffset>0x3dc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BDTBUPR</name>
          <description>HRTIM Burst DMA Timerx update register</description>
          <addressOffset>0x3e0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BDTCUPR</name>
          <description>HRTIM Burst DMA Timerx update register</description>
          <addressOffset>0x3e4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BDTDUPR</name>
          <description>HRTIM Burst DMA Timerx update register</description>
          <addressOffset>0x3e8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BDTEUPR</name>
          <description>HRTIM Burst DMA Timerx update register</description>
          <addressOffset>0x3ec</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BDMADR</name>
          <description>HRTIM Burst DMA Master Data register</description>
          <addressOffset>0x3f0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BDMADR</name>
              <description>Burst DMA Data register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
